share/doc/qmckl/text/qmckl_numprec.txt
TREX CoE


Table of Contents
_________________

1. Control of the numerical precision
2. Precision
3. Range
4. Helper functions
.. 1. Epsilon
.. 2. Testing the number of unchanged bits
5. Approximate functions
.. 1. Exponential


3+TITLE: Numerical precision


1 Control of the numerical precision
====================================

  Controlling numerical precision enables optimizations. Here, the
  default parameters determining the target numerical precision and
  range are defined. Following the IEEE Standard for Floating-Point
  Arithmetic (IEEE 754), /precision/ refers to the number of significand
  bits (including the sign bit) and /range/ refers to the number of
  exponent bits.

   `QMCKL_DEFAULT_PRECISION'  53 
   `QMCKL_DEFAULT_RANGE'      11 

  ,----
  | typedef struct qmckl_numprec_struct {
  |   uint32_t  precision;
  |   uint32_t  range;
  | } qmckl_numprec_struct;
  `----

  The following functions set and get the required precision and
  range. `precision' is an integer between 2 and 53, and `range' is an
  integer between 2 and 11.

  The setter functions functions return a new context as a 64-bit
  integer. The getter functions return the value, as a 32-bit
  integer. The update functions return `QMCKL_SUCCESS' or
  `QMCKL_FAILURE'.


2 Precision
===========
