share/doc/qmckl/text/qmckl_numprec.txt

  `qmckl_context_set_numprec_precision' modifies the parameter for the
  numerical precision in the context.

  ,----
  | qmckl_exit_code qmckl_set_numprec_precision(const qmckl_context context, const int precision) {
  | 
  |   if (qmckl_context_check(context) == QMCKL_NULL_CONTEXT)
  |     return QMCKL_INVALID_CONTEXT;
  | 
  |   if (precision <  2) {
  |     return qmckl_failwith(context,
  |                           QMCKL_INVALID_ARG_2,
  |                           "qmckl_update_numprec_precision",
  |                           "precision < 2");
  |   }
  | 
  |   if (precision > 53) {
  |     return qmckl_failwith(context,
  |                           QMCKL_INVALID_ARG_2,
  |                           "qmckl_update_numprec_precision",
  |                           "precision > 53");
  |   }
  | 
  |   qmckl_context_struct* const ctx = (qmckl_context_struct*) context;
  | 
  |   /* This should be always true because the context is valid */
  |   assert (ctx != NULL);
  | 
  |   qmckl_lock(context);
  |   {
  |     ctx->numprec.precision = (uint32_t) precision;
  |   }
  |   qmckl_unlock(context);
  | 
  |   return QMCKL_SUCCESS;
  | }
  `----

  ,----
  | interface
  |    integer (qmckl_exit_code) function qmckl_set_numprec_precision(context, precision) bind(C)
  |      use, intrinsic :: iso_c_binding
  |      import
  |      integer (qmckl_context), intent(in), value :: context
  |      integer (c_int32_t), intent(in), value :: precision
  |    end function qmckl_set_numprec_precision
  | end interface
  `----

  `qmckl_get_numprec_precision' returns the value of the numerical
  precision in the context.

  ,----
  | int qmckl_get_numprec_precision(const qmckl_context context) {
  |   if (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
  |       return qmckl_failwith(context,
  |                       QMCKL_INVALID_CONTEXT,
  |                       "qmckl_get_numprec_precision",
  |                       "");
  |   }
  | 
  |   const qmckl_context_struct* const ctx = (qmckl_context_struct*) context;
  |   return ctx->numprec.precision;
  | }
  `----

  ,----
  | interface
  |    integer (qmckl_exit_code) function qmckl_get_numprec_precision(context) bind(C)
  |      use, intrinsic :: iso_c_binding
  |      import
  |      integer (qmckl_context), intent(in), value :: context
  |    end function qmckl_get_numprec_precision
  | end interface
  `----


3 Range
=======

  `qmckl_set_numprec_range' modifies the parameter for the numerical
