qmckl_numprec.html

<div id="outline-container-org48d3181" class="outline-2">
<h2 id="org48d3181"><span class="section-number-2">3</span> Range</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>qmckl_set_numprec_range</code> modifies the parameter for the numerical
range in a given context.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_set_numprec_range</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">range</span>) {

  <span style="color: #a020f0;">if</span> (qmckl_context_check(context) == QMCKL_NULL_CONTEXT)
    <span style="color: #a020f0;">return</span> QMCKL_INVALID_CONTEXT;

  <span style="color: #a020f0;">if</span> (range &lt;  2) {
    <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                    QMCKL_INVALID_ARG_2,
                    <span style="color: #8b2252;">"qmckl_set_numprec_range"</span>,
                    <span style="color: #8b2252;">"range &lt; 2"</span>);
  }

  <span style="color: #a020f0;">if</span> (range &gt; 11) {
    <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                    QMCKL_INVALID_ARG_2,
                    <span style="color: #8b2252;">"qmckl_set_numprec_range"</span>,
                    <span style="color: #8b2252;">"range &gt; 11"</span>);
  }

  <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context;

  /* <span style="color: #b22222;">This should be always true because the context is valid</span> */
  assert (ctx != <span style="color: #008b8b;">NULL</span>);

  qmckl_lock(context);
  {
    ctx-&gt;numprec.range = (<span style="color: #228b22;">uint32_t</span>) range;
  }
  qmckl_unlock(context);

  <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">interface</span>
   <span style="color: #228b22;">integer</span> (qmckl_exit_code) <span style="color: #a020f0;">function</span> <span style="color: #0000ff;">qmckl_set_numprec_range</span>(context, range) <span style="color: #a020f0;">bind</span>(C)
     <span style="color: #a020f0;">use</span>, <span style="color: #a020f0;">intrinsic</span> :: <span style="color: #0000ff;">iso_c_binding</span>
     <span style="color: #a020f0;">import</span>
     <span style="color: #228b22;">integer</span> (qmckl_context), <span style="color: #a020f0;">intent</span>(in), <span style="color: #a020f0;">value</span> ::<span style="color: #a0522d;"> context</span>
     <span style="color: #228b22;">integer</span> (<span style="color: #008b8b;">c_int32_t</span>), <span style="color: #a020f0;">intent</span>(in), <span style="color: #a020f0;">value</span> ::<span style="color: #a0522d;"> range</span>
   <span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">qmckl_set_numprec_range</span>
<span style="color: #a020f0;">end interface</span>
</pre>
</div>

<p>
<code>qmckl_get_numprec_range</code> returns the value of the numerical range in the context.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #0000ff;">qmckl_get_numprec_range</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>) {
  <span style="color: #a020f0;">if</span> (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
      <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                      QMCKL_INVALID_CONTEXT,
                      <span style="color: #8b2252;">"qmckl_get_numprec_range"</span>,
                      <span style="color: #8b2252;">""</span>);
  }

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context;
  <span style="color: #a020f0;">return</span> ctx-&gt;numprec.range;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org5c162ef" class="outline-2">
<h2 id="org5c162ef"><span class="section-number-2">4</span> Helper functions</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org06540df" class="outline-3">
<h3 id="org06540df"><span class="section-number-3">4.1</span> Epsilon</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<code>qmckl_get_numprec_epsilon</code> returns \(\epsilon = 2^{1-n}\) where <code>n</code> is the precision.
We need to remove the sign bit from the precision.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">double</span> <span style="color: #0000ff;">qmckl_get_numprec_epsilon</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>) {
  <span style="color: #a020f0;">if</span> (qmckl_context_check(context) == QMCKL_NULL_CONTEXT)
    <span style="color: #a020f0;">return</span> QMCKL_INVALID_CONTEXT;
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context;
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">precision</span> = ctx-&gt;numprec.precision;
  <span style="color: #a020f0;">return</span> 1. /  (<span style="color: #228b22;">double</span>) ( ((<span style="color: #228b22;">uint64_t</span>) 1) &lt;&lt; (precision-2));
}
</pre>
</div>
</div>
</div>
