share/doc/qmckl/text/qmckl_numprec.txt
  range in a given context.

  ,----
  | qmckl_exit_code qmckl_set_numprec_range(const qmckl_context context, const int range) {
  | 
  |   if (qmckl_context_check(context) == QMCKL_NULL_CONTEXT)
  |     return QMCKL_INVALID_CONTEXT;
  | 
  |   if (range <  2) {
  |     return qmckl_failwith(context,
  |                     QMCKL_INVALID_ARG_2,
  |                     "qmckl_set_numprec_range",
  |                     "range < 2");
  |   }
  | 
  |   if (range > 11) {
  |     return qmckl_failwith(context,
  |                     QMCKL_INVALID_ARG_2,
  |                     "qmckl_set_numprec_range",
  |                     "range > 11");
  |   }
  | 
  |   qmckl_context_struct* const ctx = (qmckl_context_struct*) context;
  | 
  |   /* This should be always true because the context is valid */
  |   assert (ctx != NULL);
  | 
  |   qmckl_lock(context);
  |   {
  |     ctx->numprec.range = (uint32_t) range;
  |   }
  |   qmckl_unlock(context);
  | 
  |   return QMCKL_SUCCESS;
  | }
  `----

  ,----
  | interface
  |    integer (qmckl_exit_code) function qmckl_set_numprec_range(context, range) bind(C)
  |      use, intrinsic :: iso_c_binding
  |      import
  |      integer (qmckl_context), intent(in), value :: context
  |      integer (c_int32_t), intent(in), value :: range
  |    end function qmckl_set_numprec_range
  | end interface
  `----

  `qmckl_get_numprec_range' returns the value of the numerical range in
  the context.

  ,----
  | int qmckl_get_numprec_range(const qmckl_context context) {
  |   if (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
  |       return qmckl_failwith(context,
  |                       QMCKL_INVALID_CONTEXT,
  |                       "qmckl_get_numprec_range",
  |                       "");
  |   }
  | 
  |   const qmckl_context_struct* const ctx = (qmckl_context_struct*) context;
  |   return ctx->numprec.range;
  | }
  `----


4 Helper functions
==================

4.1 Epsilon
~~~~~~~~~~~

  `qmckl_get_numprec_epsilon' returns $\epsilon = 2^{1-n}$ where `n' is
  the precision.  We need to remove the sign bit from the precision.

  ,----
  | double qmckl_get_numprec_epsilon(const qmckl_context context) {
  |   if (qmckl_context_check(context) == QMCKL_NULL_CONTEXT)
  |     return QMCKL_INVALID_CONTEXT;
  |   const qmckl_context_struct* const ctx = (qmckl_context_struct*) context;
  |   const int precision = ctx->numprec.precision;
  |   return 1. /  (double) ( ((uint64_t) 1) << (precision-1));
  | }
  `----
