qmckl_numprec.html
<div id="outline-container-orgc2572bd" class="outline-3">
<h3 id="orgc2572bd"><span class="section-number-3">4.2</span> Testing the number of unchanged bits</h3>
<div class="outline-text-3" id="text-4-2">
<p>
To test that a given approximation keeps a given number of bits
unchanged, we need a function that returns the number of unchanged
bits in the range, and in the precision.
</p>

<p>
For this, we first count by how many units in the last place (ulps) two
numbers differ.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">int64_t</span> <span style="color: #0000ff;">countUlpDifference_64</span>(<span style="color: #228b22;">double</span> <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">double</span> <span style="color: #a0522d;">b</span>) {

  <span style="color: #a020f0;">union</span> <span style="color: #228b22;">int_or_float</span> {
    <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">i</span>;
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">f</span>;
  } <span style="color: #a0522d;">x</span>, <span style="color: #a0522d;">y</span>;

  x.f = a;
  y.f = b;

  // <span style="color: #b22222;">Handle sign bit discontinuity: if the signs are different and either value is not zero</span>
  <span style="color: #a020f0;">if</span> ((x.i &lt; 0) != (y.i &lt; 0) &amp;&amp; (x.f != 0.0) &amp;&amp; (y.f != 0.0)) {
    // <span style="color: #b22222;">Use the absolute values and add the distance to zero for both numbers</span>
    <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">distanceToZeroForX</span> = x.i &lt; 0 ? INT64_MAX + x.i : INT64_MAX - x.i;
    <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">distanceToZeroForY</span> = y.i &lt; 0 ? INT64_MAX + y.i : INT64_MAX - y.i;
    <span style="color: #a020f0;">return</span> distanceToZeroForX + distanceToZeroForY;
  }

  // <span style="color: #b22222;">Calculate the difference in their binary representations</span>
  <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">result</span> = x.i - y.i;
  result = result &gt; 0 ? result : -result;
  <span style="color: #a020f0;">return</span> result;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">int32_t</span> <span style="color: #0000ff;">qmckl_test_precision_64</span>(<span style="color: #228b22;">double</span> <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">double</span> <span style="color: #a0522d;">b</span>) {

  <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">diff</span> = countUlpDifference_64(a,b);

  <span style="color: #a020f0;">if</span> (diff == 0) <span style="color: #a020f0;">return</span> 53;

  <span style="color: #228b22;">int32_t</span> <span style="color: #a0522d;">result</span> = 53;

  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;53 &amp;&amp; diff != 0 ; ++i) {
    diff &gt;&gt;= 1;
    result--;
  }

  <span style="color: #a020f0;">return</span> result;
}
</pre>
</div>


<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">int32_t</span> <span style="color: #0000ff;">qmckl_test_precision_32</span>(<span style="color: #228b22;">float</span> <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">float</span> <span style="color: #a0522d;">b</span>) {
  <span style="color: #a020f0;">return</span> qmckl_test_precision_64( (<span style="color: #228b22;">double</span>) a, (<span style="color: #228b22;">double</span>) b );
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org78a9a74" class="outline-2">
<h2 id="org78a9a74"><span class="section-number-2">5</span> Approximate functions</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org7c124b2" class="outline-3">
<h3 id="org7c124b2"><span class="section-number-3">5.1</span> Exponential</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Fast exponential function, adapted from Johan Rade's implementation
(<a href="https://gist.github.com/jrade/293a73f89dfef51da6522428c857802d">https://gist.github.com/jrade/293a73f89dfef51da6522428c857802d</a>). It
is based on Schraudolph's paper:
</p>

<p>
N. Schraudolph, "A Fast, Compact Approximation of the Exponential Function",
<i>Neural Computation</i> <b>11</b>, 853–862 (1999).
(available at <a href="https://nic.schraudolph.org/pubs/Schraudolph99.pdf">https://nic.schraudolph.org/pubs/Schraudolph99.pdf</a>)
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">float</span> <span style="color: #0000ff;">fastExpf</span>(<span style="color: #228b22;">float</span> <span style="color: #a0522d;">x</span>)
{
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">float</span> <span style="color: #a0522d;">a</span> = 12102203.0;
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">float</span> <span style="color: #a0522d;">b</span> = 1064986816.0;
  x = a * x + b;

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">float</span> <span style="color: #a0522d;">c</span> = 8388608.0;
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">float</span> <span style="color: #a0522d;">d</span> = 2139095040.0;
  <span style="color: #a020f0;">if</span> (x &lt; c || x &gt; d)
    x = (x &lt; c) ? 0.0f : d;

  <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">n</span> = (<span style="color: #228b22;">uint32_t</span>) x;
  memcpy(&amp;x, &amp;n, 4);
  <span style="color: #a020f0;">return</span> x;
}


<span style="color: #228b22;">double</span> <span style="color: #0000ff;">fastExp</span>(<span style="color: #228b22;">double</span> <span style="color: #a0522d;">x</span>)
{
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">a</span> = 6497320848556798.0;
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">b</span> = 4606985713057410560.0;
  x = a * x + b;

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">c</span> = 4503599627370496.0;
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">d</span> = 9218868437227405312.0;
  <span style="color: #a020f0;">if</span> (x &lt; c || x &gt; d)
    x = (x &lt; c) ? 0.0 : d;

  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">n</span> = (<span style="color: #228b22;">uint64_t</span>) x;
  memcpy(&amp;x, &amp;n, 8);
  <span style="color: #a020f0;">return</span> x;
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: TREX CoE</p>
<p class="date">Created: 2024-11-04 Mon 15:49</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
