share/doc/qmckl/text/qmckl_numprec.txt


4.2 Testing the number of unchanged bits
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

  To test that a given approximation keeps a given number of bits
  unchanged, we need a function that returns the number of unchanged
  bits in the range, and in the precision.

  For this, we first count by how many units in the last place (ulps)
  two numbers differ.

  ,----
  | int64_t countUlpDifference_64(double a, double b) {
  | 
  |   union int_or_float {
  |     int64_t i;
  |     double f;
  |   } x, y;
  | 
  |   x.f = a;
  |   y.f = b;
  | 
  |   // Handle sign bit discontinuity: if the signs are different and either value is not zero
  |   if ((x.i < 0) != (y.i < 0) && (x.f != 0.0) && (y.f != 0.0)) {
  |     // Use the absolute values and add the distance to zero for both numbers
  |     int64_t distanceToZeroForX = x.i < 0 ? INT64_MAX + x.i : INT64_MAX - x.i;
  |     int64_t distanceToZeroForY = y.i < 0 ? INT64_MAX + y.i : INT64_MAX - y.i;
  |     return distanceToZeroForX + distanceToZeroForY;
  |   }
  | 
  |   // Calculate the difference in their binary representations
  |   int64_t result = x.i - y.i;
  |   result = result > 0 ? result : -result;
  |   return result;
  | }
  `----

  ,----
  | int32_t qmckl_test_precision_64(double a, double b) {
  | 
  |   int64_t diff = countUlpDifference_64(a,b);
  | 
  |   if (diff == 0) return 53;
  | 
  |   int32_t result = 53;
  | 
  |   for (int i=0 ; i<53 && diff != 0 ; ++i) {
  |     diff >>= 1;
  |     result--;
  |   }
  | 
  |   return result;
  | }
  `----


  ,----
  | int32_t qmckl_test_precision_32(float a, float b) {
  |   return qmckl_test_precision_64( (double) a, (double) b );
  | }
  `----


5 Approximate functions
=======================

5.1 Exponential
~~~~~~~~~~~~~~~

  Fast exponential function, adapted from Johan Rade's implementation
  (<https://gist.github.com/jrade/293a73f89dfef51da6522428c857802d>). It
  is based on Schraudolph's paper:

  N. Schraudolph, "A Fast, Compact Approximation of the Exponential
  Function", /Neural Computation/ *11*, 853–862 (1999).  (available at
  <https://nic.schraudolph.org/pubs/Schraudolph99.pdf>)

  ,----
  | float fastExpf(float x)
  | {
  |   const float a = 12102203.0;
  |   const float b = 1064986816.0;
  |   x = a * x + b;
  | 
  |   const float c = 8388608.0;
  |   const float d = 2139095040.0;
  |   if (x < c || x > d)
  |     x = (x < c) ? 0.0f : d;
  | 
  |   uint32_t n = (uint32_t) x;
  |   memcpy(&x, &n, 4);
  |   return x;
  | }
  | 
  | 
  | double fastExp(double x)
  | {
  |   const double a = 6497320848556798.0;
  |   const double b = 4606985713057410560.0;
  |   x = a * x + b;
  | 
  |   const double c = 4503599627370496.0;
  |   const double d = 9218868437227405312.0;
  |   if (x < c || x > d)
  |     x = (x < c) ? 0.0 : d;
  | 
  |   uint64_t n = (uint64_t) x;
  |   memcpy(&x, &n, 8);
  |   return x;
  | }
  `----
